local/artillery/test-anilove-local.yml
# Local Docker AniLove - short phases for laptop runs
config:
  target: "http://localhost:3000"
  phases:
    # Warm-up
    - duration: 30
      arrivalRate: 2
    # Steady
    - duration: 60
      arrivalRate: 5
    # Short stress
    - duration: 30
      arrivalRate: 10
    # Recovery
    - duration: 30
      arrivalRate: 3

  defaults:
    headers:
      Content-Type: application/json
    http:
      timeout: 30

  plugins:
    publish-metrics:
      - type: prometheus
        pushgateway: "http://localhost:9093"
        testName: "anilove-local-load-test"
        environment: "local"
        labels:
          service: "anilove-service"
          scenario: "animes-crud"
          instance: local

scenarios:
  - name: Animes CRUD (local)
    flow:
      - post:
          url: "/animes"
          capture:
            - json: "$.id"
              as: "animeId"
          json:
            title: "Anime_{{ $randomNumber(1,9999) }}_{{ $timestamp }}_{{ $uuid }}"
            genre: ["Action", "Fantasy"]
            episodes: "{{ $randomNumber(12, 50) }}"
            note: "{{ $randomNumber(1, 10) }}"

      - get:
          url: "/animes"

      - get:
          url: "/animes/{{ animeId }}"

      - put:
          url: "/animes/{{ animeId }}"
          json:
            title: "Anime_Updated_{{ $randomNumber(1, 9999) }}_{{ $uuid }}"
            genre: ["Adventure"]
            episodes: 24
            note: 9

      - delete:
          url: "/animes/{{ animeId }}"